Revit 2024 API
ViewShapeBuilder.Reset Method
 Clears the accumulated geometry and resets other ViewShapeBuilder parameters to invalid values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void Reset()
Visual Basic
Public Sub Reset
Visual C++
public:
void Reset()
See Also
ViewShapeBuilder Class
Autodesk.Revit.DB Namespace